apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_rtc_io.h
/* RTCIO_RTC_GPIO_STATUS_W1TS_REG register
 * RTC GPIO interrupt status bit set register
 */

#define RTCIO_RTC_GPIO_STATUS_W1TS_REG (DR_REG_RTCIO_BASE + 0x1c)

/* RTCIO_GPIO_STATUS_INT_W1TS : WO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 interrupt set register. If the value 1 is written to a bit
 * here, the corresponding bit in RTCIO_GPIO_STATUS_INT will be set to 1.
 * Recommended operation: use this register to set RTCIO_GPIO_STATUS_INT.
 */

#define RTCIO_GPIO_STATUS_INT_W1TS    0x003FFFFF
#define RTCIO_GPIO_STATUS_INT_W1TS_M  (RTCIO_GPIO_STATUS_INT_W1TS_V << RTCIO_GPIO_STATUS_INT_W1TS_S)
#define RTCIO_GPIO_STATUS_INT_W1TS_V  0x003FFFFF
#define RTCIO_GPIO_STATUS_INT_W1TS_S  10

/* RTCIO_RTC_GPIO_STATUS_W1TC_REG register
 * RTC GPIO interrupt status bit clear register
 */

#define RTCIO_RTC_GPIO_STATUS_W1TC_REG (DR_REG_RTCIO_BASE + 0x20)

/* RTCIO_GPIO_STATUS_INT_W1TC : WO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 interrupt clear register. If the value 1 is written to a bit
 * here, the corresponding bit in RTCIO_GPIO_STATUS_INT will be cleared.
 * Recommended operation: use this register to clear RTCIO_GPIO_STATUS_INT.
 */

#define RTCIO_GPIO_STATUS_INT_W1TC    0x003FFFFF
#define RTCIO_GPIO_STATUS_INT_W1TC_M  (RTCIO_GPIO_STATUS_INT_W1TC_V << RTCIO_GPIO_STATUS_INT_W1TC_S)
#define RTCIO_GPIO_STATUS_INT_W1TC_V  0x003FFFFF
#define RTCIO_GPIO_STATUS_INT_W1TC_S  10

/* RTCIO_RTC_GPIO_IN_REG register
 * RTC GPIO input register
 */

#define RTCIO_RTC_GPIO_IN_REG (DR_REG_RTCIO_BASE + 0x24)

/* RTCIO_GPIO_IN_NEXT : RO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 input value. Bit10 corresponds to GPIO0, bit11 corresponds to
 * GPIO1, etc. Each bit represents a pad input value, 1 for high level, and
 * 0 for low level.
 */

#define RTCIO_GPIO_IN_NEXT    0x003FFFFF
#define RTCIO_GPIO_IN_NEXT_M  (RTCIO_GPIO_IN_NEXT_V << RTCIO_GPIO_IN_NEXT_S)
#define RTCIO_GPIO_IN_NEXT_V  0x003FFFFF
#define RTCIO_GPIO_IN_NEXT_S  10

/* RTCIO_RTC_GPIO_PIN0_REG register
 * RTC configuration for pin 0
 */

#define RTCIO_RTC_GPIO_PIN0_REG (DR_REG_RTCIO_BASE + 0x28)

/* RTCIO_GPIO_PIN0_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN0_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN0_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN0_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN0_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN0_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN0_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN0_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN0_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN0_INT_TYPE_M  (RTCIO_GPIO_PIN0_INT_TYPE_V << RTCIO_GPIO_PIN0_INT_TYPE_S)
#define RTCIO_GPIO_PIN0_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN0_INT_TYPE_S  7

/* RTCIO_GPIO_PIN0_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN0_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN0_PAD_DRIVER_M  (RTCIO_GPIO_PIN0_PAD_DRIVER_V << RTCIO_GPIO_PIN0_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN0_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN0_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN1_REG register
 * RTC configuration for pin 1
 */

#define RTCIO_RTC_GPIO_PIN1_REG (DR_REG_RTCIO_BASE + 0x2c)

/* RTCIO_GPIO_PIN1_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN1_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN1_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN1_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN1_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN1_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN1_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN1_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN1_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN1_INT_TYPE_M  (RTCIO_GPIO_PIN1_INT_TYPE_V << RTCIO_GPIO_PIN1_INT_TYPE_S)
#define RTCIO_GPIO_PIN1_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN1_INT_TYPE_S  7

/* RTCIO_GPIO_PIN1_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN1_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN1_PAD_DRIVER_M  (RTCIO_GPIO_PIN1_PAD_DRIVER_V << RTCIO_GPIO_PIN1_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN1_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN1_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN2_REG register
 * RTC configuration for pin 2
 */

#define RTCIO_RTC_GPIO_PIN2_REG (DR_REG_RTCIO_BASE + 0x30)

/* RTCIO_GPIO_PIN2_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN2_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN2_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN2_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN2_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN2_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN2_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN2_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN2_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN2_INT_TYPE_M  (RTCIO_GPIO_PIN2_INT_TYPE_V << RTCIO_GPIO_PIN2_INT_TYPE_S)
#define RTCIO_GPIO_PIN2_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN2_INT_TYPE_S  7

/* RTCIO_GPIO_PIN2_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN2_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN2_PAD_DRIVER_M  (RTCIO_GPIO_PIN2_PAD_DRIVER_V << RTCIO_GPIO_PIN2_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN2_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN2_PAD_DRIVER_S  2

