apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_rtc_io.h
/* RTCIO_RTC_GPIO_PIN18_REG register
 * RTC configuration for pin 18
 */

#define RTCIO_RTC_GPIO_PIN18_REG (DR_REG_RTCIO_BASE + 0x70)

/* RTCIO_GPIO_PIN18_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN18_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN18_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN18_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN18_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN18_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN18_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN18_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN18_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN18_INT_TYPE_M  (RTCIO_GPIO_PIN18_INT_TYPE_V << RTCIO_GPIO_PIN18_INT_TYPE_S)
#define RTCIO_GPIO_PIN18_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN18_INT_TYPE_S  7

/* RTCIO_GPIO_PIN18_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN18_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN18_PAD_DRIVER_M  (RTCIO_GPIO_PIN18_PAD_DRIVER_V << RTCIO_GPIO_PIN18_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN18_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN18_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN19_REG register
 * RTC configuration for pin 19
 */

#define RTCIO_RTC_GPIO_PIN19_REG (DR_REG_RTCIO_BASE + 0x74)

/* RTCIO_GPIO_PIN19_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN19_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN19_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN19_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN19_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN19_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN19_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN19_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN19_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN19_INT_TYPE_M  (RTCIO_GPIO_PIN19_INT_TYPE_V << RTCIO_GPIO_PIN19_INT_TYPE_S)
#define RTCIO_GPIO_PIN19_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN19_INT_TYPE_S  7

/* RTCIO_GPIO_PIN19_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN19_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN19_PAD_DRIVER_M  (RTCIO_GPIO_PIN19_PAD_DRIVER_V << RTCIO_GPIO_PIN19_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN19_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN19_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN20_REG register
 * RTC configuration for pin 20
 */

#define RTCIO_RTC_GPIO_PIN20_REG (DR_REG_RTCIO_BASE + 0x78)

/* RTCIO_GPIO_PIN20_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN20_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN20_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN20_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN20_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN20_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN20_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN20_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN20_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN20_INT_TYPE_M  (RTCIO_GPIO_PIN20_INT_TYPE_V << RTCIO_GPIO_PIN20_INT_TYPE_S)
#define RTCIO_GPIO_PIN20_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN20_INT_TYPE_S  7

/* RTCIO_GPIO_PIN20_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN20_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN20_PAD_DRIVER_M  (RTCIO_GPIO_PIN20_PAD_DRIVER_V << RTCIO_GPIO_PIN20_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN20_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN20_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN21_REG register
 * RTC configuration for pin 21
 */

#define RTCIO_RTC_GPIO_PIN21_REG (DR_REG_RTCIO_BASE + 0x7c)

/* RTCIO_GPIO_PIN21_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN21_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN21_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN21_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN21_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN21_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN21_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN21_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN21_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN21_INT_TYPE_M  (RTCIO_GPIO_PIN21_INT_TYPE_V << RTCIO_GPIO_PIN21_INT_TYPE_S)
#define RTCIO_GPIO_PIN21_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN21_INT_TYPE_S  7

/* RTCIO_GPIO_PIN21_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN21_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN21_PAD_DRIVER_M  (RTCIO_GPIO_PIN21_PAD_DRIVER_V << RTCIO_GPIO_PIN21_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN21_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN21_PAD_DRIVER_S  2

/* RTCIO_RTC_DEBUG_SEL_REG register
 * RTC debug select register
 */

#define RTCIO_RTC_DEBUG_SEL_REG (DR_REG_RTCIO_BASE + 0x80)

/* RTCIO_RTC_DEBUG_12M_NO_GATING : R/W; bitpos: [25]; default: 0; */

#define RTCIO_RTC_DEBUG_12M_NO_GATING    (BIT(25))
#define RTCIO_RTC_DEBUG_12M_NO_GATING_M  (RTCIO_RTC_DEBUG_12M_NO_GATING_V << RTCIO_RTC_DEBUG_12M_NO_GATING_S)
#define RTCIO_RTC_DEBUG_12M_NO_GATING_V  0x00000001
#define RTCIO_RTC_DEBUG_12M_NO_GATING_S  25

