apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_rtc_io.h
/* RTCIO_RTC_PAD21_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_RTC_PAD21_FUN_SEL    0x00000003
#define RTCIO_RTC_PAD21_FUN_SEL_M  (RTCIO_RTC_PAD21_FUN_SEL_V << RTCIO_RTC_PAD21_FUN_SEL_S)
#define RTCIO_RTC_PAD21_FUN_SEL_V  0x00000003
#define RTCIO_RTC_PAD21_FUN_SEL_S  17

/* RTCIO_RTC_PAD21_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 1: enable sleep mode, 0: no sleep mode
 */

#define RTCIO_RTC_PAD21_SLP_SEL    (BIT(16))
#define RTCIO_RTC_PAD21_SLP_SEL_M  (RTCIO_RTC_PAD21_SLP_SEL_V << RTCIO_RTC_PAD21_SLP_SEL_S)
#define RTCIO_RTC_PAD21_SLP_SEL_V  0x00000001
#define RTCIO_RTC_PAD21_SLP_SEL_S  16

/* RTCIO_RTC_PAD21_SLP_IE : R/W; bitpos: [15]; default: 0;
 * input enable in sleep mode
 */

#define RTCIO_RTC_PAD21_SLP_IE    (BIT(15))
#define RTCIO_RTC_PAD21_SLP_IE_M  (RTCIO_RTC_PAD21_SLP_IE_V << RTCIO_RTC_PAD21_SLP_IE_S)
#define RTCIO_RTC_PAD21_SLP_IE_V  0x00000001
#define RTCIO_RTC_PAD21_SLP_IE_S  15

/* RTCIO_RTC_PAD21_SLP_OE : R/W; bitpos: [14]; default: 0;
 * output enable in sleep mode
 */

#define RTCIO_RTC_PAD21_SLP_OE    (BIT(14))
#define RTCIO_RTC_PAD21_SLP_OE_M  (RTCIO_RTC_PAD21_SLP_OE_V << RTCIO_RTC_PAD21_SLP_OE_S)
#define RTCIO_RTC_PAD21_SLP_OE_V  0x00000001
#define RTCIO_RTC_PAD21_SLP_OE_S  14

/* RTCIO_RTC_PAD21_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_RTC_PAD21_FUN_IE    (BIT(13))
#define RTCIO_RTC_PAD21_FUN_IE_M  (RTCIO_RTC_PAD21_FUN_IE_V << RTCIO_RTC_PAD21_FUN_IE_S)
#define RTCIO_RTC_PAD21_FUN_IE_V  0x00000001
#define RTCIO_RTC_PAD21_FUN_IE_S  13

/* RTCIO_EXT_WAKEUP0_REG register
 * External wake up configuration register
 */

#define RTCIO_EXT_WAKEUP0_REG (DR_REG_RTCIO_BASE + 0xdc)

/* RTCIO_EXT_WAKEUP0_SEL : R/W; bitpos: [31:27]; default: 0;
 * GPIO[0-17] can be used to wake up the chip when the chip is in the sleep
 * mode. This register prompts the pad source to wake up the chip when the
 * latter is indeep/light sleep mode.
 * 0: select GPIO0; 1: select GPIO2, etc
 */

#define RTCIO_EXT_WAKEUP0_SEL    0x0000001F
#define RTCIO_EXT_WAKEUP0_SEL_M  (RTCIO_EXT_WAKEUP0_SEL_V << RTCIO_EXT_WAKEUP0_SEL_S)
#define RTCIO_EXT_WAKEUP0_SEL_V  0x0000001F
#define RTCIO_EXT_WAKEUP0_SEL_S  27

/* RTCIO_XTL_EXT_CTR_REG register
 * Crystal power down enable GPIO source
 */

#define RTCIO_XTL_EXT_CTR_REG (DR_REG_RTCIO_BASE + 0xe0)

/* RTCIO_XTL_EXT_CTR_SEL : R/W; bitpos: [31:27]; default: 0;
 * Select the external crystal power down enable source to get into sleep
 * mode. 0: select GPIO0; 1: select GPIO1, etc. The input value on this pin
 * XOR RTC_CNTL_EXT_XTL_CONF_REG[30] is the crystal power down enable signal.
 */

#define RTCIO_XTL_EXT_CTR_SEL    0x0000001F
#define RTCIO_XTL_EXT_CTR_SEL_M  (RTCIO_XTL_EXT_CTR_SEL_V << RTCIO_XTL_EXT_CTR_SEL_S)
#define RTCIO_XTL_EXT_CTR_SEL_V  0x0000001F
#define RTCIO_XTL_EXT_CTR_SEL_S  27

/* RTCIO_SAR_I2C_IO_REG register
 * RTC I²C pad selection
 */

#define RTCIO_SAR_I2C_IO_REG (DR_REG_RTCIO_BASE + 0xe4)

/* RTCIO_SAR_I2C_SDA_SEL : R/W; bitpos: [31:30]; default: 0;
 * Selects a pad the RTC I2C SDA signal connects to. 0: use TOUCH PAD1; 1:
 * use TOUCH PAD3.
 */

#define RTCIO_SAR_I2C_SDA_SEL    0x00000003
#define RTCIO_SAR_I2C_SDA_SEL_M  (RTCIO_SAR_I2C_SDA_SEL_V << RTCIO_SAR_I2C_SDA_SEL_S)
#define RTCIO_SAR_I2C_SDA_SEL_V  0x00000003
#define RTCIO_SAR_I2C_SDA_SEL_S  30

/* RTCIO_SAR_I2C_SCL_SEL : R/W; bitpos: [29:28]; default: 0;
 * Selects a pad the RTC I2C SCL signal connects to. 0: use TOUCH PAD0; 1:
 * use TOUCH PAD2.
 */

#define RTCIO_SAR_I2C_SCL_SEL    0x00000003
#define RTCIO_SAR_I2C_SCL_SEL_M  (RTCIO_SAR_I2C_SCL_SEL_V << RTCIO_SAR_I2C_SCL_SEL_S)
#define RTCIO_SAR_I2C_SCL_SEL_V  0x00000003
#define RTCIO_SAR_I2C_SCL_SEL_S  28

/* RTCIO_SAR_DEBUG_BIT_SEL : R/W; bitpos: [27:23]; default: 0; */

#define RTCIO_SAR_DEBUG_BIT_SEL    0x0000001F
#define RTCIO_SAR_DEBUG_BIT_SEL_M  (RTCIO_SAR_DEBUG_BIT_SEL_V << RTCIO_SAR_DEBUG_BIT_SEL_S)
#define RTCIO_SAR_DEBUG_BIT_SEL_V  0x0000001F
#define RTCIO_SAR_DEBUG_BIT_SEL_S  23

/* RTCIO_RTC_IO_TOUCH_CTRL_REG register
 * Touch Control register
 */

#define RTCIO_RTC_IO_TOUCH_CTRL_REG (DR_REG_RTCIO_BASE + 0xe8)

/* RTCIO_IO_TOUCH_BUFMODE : R/W; bitpos: [4]; default: 0; */

#define RTCIO_IO_TOUCH_BUFMODE    (BIT(4))
#define RTCIO_IO_TOUCH_BUFMODE_M  (RTCIO_IO_TOUCH_BUFMODE_V << RTCIO_IO_TOUCH_BUFMODE_S)
#define RTCIO_IO_TOUCH_BUFMODE_V  0x00000001
#define RTCIO_IO_TOUCH_BUFMODE_S  4

/* RTCIO_IO_TOUCH_BUFSEL : R/W; bitpos: [3:0]; default: 0; */

#define RTCIO_IO_TOUCH_BUFSEL    0x0000000F
#define RTCIO_IO_TOUCH_BUFSEL_M  (RTCIO_IO_TOUCH_BUFSEL_V << RTCIO_IO_TOUCH_BUFSEL_S)
#define RTCIO_IO_TOUCH_BUFSEL_V  0x0000000F
#define RTCIO_IO_TOUCH_BUFSEL_S  0

/* RTCIO_RTC_IO_DATE_REG register
 * Version control register
 */

#define RTCIO_RTC_IO_DATE_REG (DR_REG_RTCIO_BASE + 0x1fc)

/* RTCIO_IO_DATE : R/W; bitpos: [27:0]; default: 26227056;
 * Version control register
 */

#define RTCIO_IO_DATE    0x0FFFFFFF
#define RTCIO_IO_DATE_M  (RTCIO_IO_DATE_V << RTCIO_IO_DATE_S)
#define RTCIO_IO_DATE_V  0x0FFFFFFF
#define RTCIO_IO_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_RTCIO_H */
